//=================================================================================================
//
// LoadCharaBin_s3d ヘッダファイル
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
//#include "LoadCharaBinFunc_s3d.h"
#include "LoadCharaBinFunc.h"

//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//------------------------------------------------------
	// .datファイルからCharaを読み込む
	//------------------------------------------------------
	class LoadCharaBin_s3d
	{
//		LoadCharaBinFunc_s3d	m_func;
		LoadCharaBinFunc		m_func;

		//try用
		void _Load ( const s3d::String & filename,  Chara & chara );

	public:
		LoadCharaBin_s3d ( const s3d::String & filename,  Chara & chara );
		LoadCharaBin_s3d ( const LoadCharaBin_s3d& rhs ) = delete;
		~LoadCharaBin_s3d ();
	};


}	//namespace GAME


