//=================================================================================================
//
// LoadChara_s3d ヘッダファイル
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "IOCharaDefine.h"
#include "LoadCharaFunc.h"
#include "LoadCharaUtl.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//------------------------------------------------------
	// .datファイルからCharaを読み込む
	//------------------------------------------------------
	class LoadChara_s3d
	{
		//try用
		void _Load ( const tstring & filename,  Chara & chara );

		//内部使用関数群
		LoadCharaFunc	m_func;
		LoadCharaUtl	m_utl;

	public:
		LoadChara_s3d ( const tstring & filename,  Chara & chara );
		LoadChara_s3d ( const LoadChara_s3d& rhs ) = delete;
		~LoadChara_s3d ();
	};


}	//namespace GAME


