//=================================================================================================
//
//	ScriptParam_Battle ヘッダファイル
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
//#include "Game.h"
//#include "DxDefine.h"
#include "Define.h"
#include "Chara_Const.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	struct ScriptParam_Battle
	{
	public:
		ScriptParam_Battle ();
		ScriptParam_Battle ( const ScriptParam_Battle & rhs ) = delete;
		~ScriptParam_Battle ();

		CLC_ST	CalcState { CLC_SUBSTITUDE };	//計算状態
		VEC2 Vel { 0, 0 };		//速度
		VEC2 Acc { 0, 0 };		//加速度
		int Power { 0 };		//攻撃値
		int Warp { 0 };			//ヒット時のけぞり[F] == ヒットストップ追加(相手)
		int Recoil_I { 0 };		//反動(x,y)(自分)
		int Recoil_E { 0 };		//反動(x,y)(相手)
		int Balance_I { 0 };	//バランス増減(自分)
		int Balance_E { 0 };	//バランス増減(相手)

		int Gauge_I { 0 };		//ゲージ増減(自分)
		int Gauge_E { 0 };		//ゲージ増減(相手)

		int DirectDamage { 0 };	//直接ダメージ(相手)
		//直接ダメージ(自分)
		
		//ヒットストップ追加(自分)
		//ガード硬直（自分・相手）
	};


}	//namespace GAME


