//=================================================================================================
//
//	Action ソースファイル
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Action.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	Action::Action ()
		: m_category ( AC_NEUTRAL ), m_posture ( AP_STAND )
		, m_hitNum ( 0 ), m_hitPitch ( 0 ), m_balance ( 0 )
	{
	}

	Action::~Action ()
	{
	}


	int Action::GetVersatile ( size_t index ) const
	{
		//範囲チェック
		if ( index < VRS_SIZE ) { return 0; }

		return m_versatile [ index ];
	}

	void Action::SetVersatile ( size_t index, int value )
	{
		//範囲チェック
		if ( index < VRS_SIZE ) { return; }

		m_versatile [ index ] = value;
	}


}	//namespace GAME

