//=================================================================================================
//
//	EfSouha ヘッダファイル
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"
#include "../../GameMain/GameConst.h"
#include "../../FtgMain/FtgConst.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//剣撃走破 エフェクト
	class EfSouha : public GrpEf
	{
		P_GrpEf		m_souha;

		VEC2		m_scalingStart { 0.1f, 0.1f };
		VEC2		m_scaling { 1.f, 1.f };
		VEC2		m_vStart { 0.f, 0.f };
		VEC2		m_v { 0.f, 0.f };
		VEC2		m_a { 0.f, 0.f };

		Timer		m_timer;

	public:
		EfSouha ();
		EfSouha ( const EfSouha & rhs ) = delete;
		~EfSouha ();

		void Init ();
		void Move ();

		void On ( VEC2 center );
	};

	using P_EfSouha = std::shared_ptr < EfSouha >;


}	//namespace GAME


