//=================================================================================================
//
// SoundConst ファイル
//		音声ファイル指定用 定数
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
//	インクルードファイル
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
//	定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//------------------------------------------
	// 定数宣言
	//------------------------------------------
	//Soundフォルダ、SEフォルダ内の読込ファイル順(ABC)にIDが振られる
	//フォルダ内では順序保持のためにID(連番)を付けるが、
	//enumでは変更可能性のためIDを付けない

	//BGM
	enum BGM_ID
	{
//		BGM_Title,
//		BGM_Intro,
//		BGM_Main,
//		BGM_Result,
//		BGM_CharaSele,
		BGM_GABA,
		BGM_TOMOE,
		BGM_OUKA,
		BGM_RETSU,
		BGM_ENEMY0,
		BGM_FERA,

		BGM_CHARA_SELE,
	};

	//SE
	enum SE_ID
	{
		SE_Sys_Pdding,
		SE_Sys_Select,
		SE_Sys_Enter,
		SE_Sys_Cancel,
		SE_Sys_Lock,
		SE_Sys_EnterFighting,
		SE_Btl_Hit_L,
		SE_Btl_Hit_M,
		SE_Btl_Hit_H,
		SE_Btl_Jump,
		SE_Btl_Landing,
		SE_Btl_Dash,
		SE_Btl_Air,
		SE_Btl_break,
		SE_Btl_Light,
		SE_Btl_Clang,
		SE_Btl_Extract_sword,
	};

}

