//=================================================================================================
//
//	テスト
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "_CharaSele_Actor.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	_CharaSele_Actor::_CharaSele_Actor ()
	{
		//各種ステート
		m_state_Ch  = std::make_shared < ChSl_St_Chara > ();
		m_state_Clr = std::make_shared < ChSl_St_Color > ();
		m_state_Stg = std::make_shared < ChSl_St_Stage > ();
		m_state_BGM = std::make_shared < ChSl_St_BGM > ();
		m_state_OK  = std::make_shared < ChSl_St_OK > ();

		//最初のステート
		m_state = m_state_Ch;
	}


	_CharaSele_Actor::~_CharaSele_Actor ()
	{
	}



	//キャラクタ選択
	void _CharaSele_Actor::StartCh ()
	{
		m_state = m_state_Ch;
	}



}	//namespace GAME

