//=================================================================================================
//
//	WallBreak ヘッダファイル
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"
#include "FtgConst.h"	


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	class WallBreak : public TASK_VEC
	{
		P_Grp		m_grp;
		Timer		m_timer { 4 };
		uint32		m_index { 0 };

	public:
		WallBreak ();
		WallBreak ( const WallBreak & rhs ) = delete;
		~WallBreak ();

		void Init ();
		void Move ();

		void On ();
		void Off ();

		void SetPos ( float x );
	};

	using P_WallBreak = std::shared_ptr < WallBreak >;


}	//namespace GAME


